FineMeshWInletFoamrhoPimpleFoamras/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    inletFace
    {
       type calculated;
       value uniform 0;
    }
    inletWall
    {
       type compressible::alphatWallFunction;
       Prt  0.85;
       value uniform 0;
    }
    inletsourceFace
    {
        type calculated;
        value uniform 0;
    }
    inletdestinationFace
    {
        type calculated;
        value uniform 0;
    }
    fineMeshWall
    {
       type compressible::alphatWallFunction;
       Prt  0.85;
       value uniform 0;
    }
    fineMeshSourceFace
    {
        type calculated;
        value uniform 0;
    }
    fineMeshdestinationFace
    {
        type calculated;
        value uniform 0;
    }
    fineMeshSymmetryWall
    {
        type   symmetryPlane;
    }
    fineMeshOutletLeft
    {
        type calculated;
        value uniform 0;
    }
    fineMeshOutletBottom
    {
        type calculated;
        value uniform 0;
    }


}


// ************************************************************************* //
