FineMeshWInletFoamrhoPimpleFoamras/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.1                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kEpsilon;

//    turbulence      on;
    turbulence      off;

    printCoeffs     on;


   kEpsilonCoeffs
   {
      Cmu             0.09;
   //   C1              1.44;
      C1              1.24;
  //    C2              1.92;
      C2              2.05;
      C3              -0.33;
      sigmak          1;
      sigmaEps        1.3;
}

}


// ************************************************************************* //
